<template>
  <section id="FAQ" class="container mt-20">
    <h2 class="max-sxxs:text-2xl max-sm:text-3xl max-md:text-4xl text-5xl text-center font-extrabold pt-20">
      ЧАСТО ЗАДАВАЕМЫЕ ВОПРОСЫ
    </h2>
    <div class="mt-10 ">
      <Accordion>
        <AccordionTab v-for="(item, ind) in data.items" :key="ind">
          <template #header>
            <div class="flex gap-5 items-center">
              <span class="font-light text-primary2">
                {{ item.num }}
              </span>
              <span class="font-bold max-ss:text-xl text-3xl text-black">
                {{ item.title }}
              </span>
            </div>
          </template>
          <ul class="m-0 list-disc ml-5 font-medium  max-ss:text-sm text-xl" v-html="item.descr" />
        </AccordionTab>
      </Accordion>
    </div>
  </section>
</template>

<script setup lang="ts">
const data = reactive({
  items: [
    {
      num: '01',
      title: 'Когда следует производить замену летней резины на зимнюю?',
      descr: 'В России рекомендуется менять летнюю резину на зимнюю, когда среднесуточная температура опускается ниже +5°C. Это связано с тем, что при такой температуре летняя резина теряет свои свойства и становится менее эффективной. Однако, стоит учитывать климатические особенности вашего региона и следить за прогнозом погоды.'
    },
    {
      num: '02',
      title: 'Как выбрать зимнюю резину?',
      descr: 'При выборе зимней резины необходимо учитывать следующие факторы: <br> <li>Тип шин: зимние шины могут быть шипованными или фрикционными (нешипованными). Шипованные шины обеспечивают лучшее сцепление на льду и снегу, но могут шуметь на асфальте. Фрикционные шины более тихие и подходят для городских условий, но хуже справляются со льдом и снегом.</li> <li> Размер шин: выбирайте размер шин, рекомендованный производителем вашего автомобиля. Неправильный размер может привести к ухудшению управляемости и увеличению расхода топлива. </li> <li> Индекс скорости и нагрузки: эти параметры указывают на максимальную скорость и нагрузку, которую могут выдержать шины. Выбирайте шины с индексом, соответствующим вашему стилю вождения. </li> <li> Бренд: выбирайте шины от известных производителей, которые имеют хорошую репутацию и предлагают широкий ассортимент моделей. </li> <li> Также стоит обратить внимание на отзывы других автовладельцев и рекомендации экспертов.</li>'
    },
    {
      num: '03',
      title: 'Какой рекомендованный ресурс у зимней и летней резины?',
      descr: 'Рекомендованный ресурс зимней и летней резины зависит от производителя, модели и условий эксплуатации. В среднем, зимняя резина служит 40–60 тысяч километров, а летняя — 50–70 тысяч километров. Однако, это лишь ориентировочные значения, и реальный ресурс может отличаться в зависимости от условий использования.'
    },
    {
      num: '04',
      title: 'Можно ли записаться на шиномонтаж заранее?',
      descr: 'Да, можно записаться на шиномонтаж заранее, чтобы избежать очередей и получить удобное время. Мы предлагаем запись через интернет или по телефону'
    },
    {
      num: '05',
      title: 'Что выбрать — шипы или липучку?',
      descr: 'Выбор между шипами и липучкой зависит от ваших потребностей и условий эксплуатации: <li> Шипы лучше подходят для регионов с суровыми зимами и большим количеством снега и льда. Они обеспечивают хорошее сцепление на скользких поверхностях, но могут создавать шум на асфальте и повреждать дорожное покрытие. </li> <li> Липучка подходит для городских условий и регионов с умеренными зимами. Она обеспечивает хорошее сцепление на мокром и сухом асфальте, но может хуже справляться со льдом и снегом.</li>'
    },
    {
      num: '06',
      title: 'Как выбрать летнюю резину?',
      descr: 'При выборе летней резины необходимо учитывать следующие факторы: <li> Тип шин: летние шины могут быть шоссейными, предназначенными для езды по асфальту, или универсальными, подходящими как для асфальта, так и для лёгкого бездорожья. </li> <li> Размер шин: выбирайте размер шин, рекомендованный производителем вашего автомобиля. Неправильный размер может привести к ухудшению управляемости и увеличению расхода топлива. </li> <li> Индекс скорости и нагрузки: эти параметры указывают на максимальную скорость и нагрузку, которую могут выдержать шины. Выбирайте шины с индексом, соответствующим вашему стилю вождения. </li> <li> Бренд: выбирайте шины от известных производителей, которые имеют хорошую репутацию и предлагают широкий ассортимент моделей </li> <br> Также стоит обратить внимание на отзывы других автовладельцев и рекомендации экспертов.'
    }
  ]
})
</script>

<style scoped>

</style>
